Neel-729/DeskDroid/firmware/esp32/src/app/application.cpp
#include "application.h"

#include <esp_system.h>
#include <Arduino.h>

#include "application_commands.h"
#include "hardware_requests.h"
#include "input_service.h"
#include "navigation.h"
#include "settings_flow.h"
#include "system_context.h"
#include "../core/events.h"
#include "../core/fault_tracker.h"
#include "../core/logging.h"
#include "../core/scheduler.h"
#include "../core/settings_store.h"
#include "../core/system_state.h"
#include "../core/time_service.h"
#include "../drivers/lcd_driver.h"
#include "../features/clock.h"
#include "../features/reminders.h"
#include "../features/stopwatch.h"
#include "../features/timer.h"
#include "../protocol/esp8266_link.h"
#include "../protocol/uart_monitor.h"
#include "../services/audio_service.h"
#include "../services/lighting_service.h"
#include "../services/services.h"
#include "../services/timer_service.h"
#include "../ui/screens.h"

namespace {

constexpr const char* FIRMWARE_VERSION = "2.6.2";

SystemContext systemContext;

void runBuzzerTask(FrameContext &context);
void runEsp8266LinkTask(FrameContext &context);
void runHardwareRequestTask(FrameContext &context);
void runLightingTask(FrameContext &context);
void runTimerTask(FrameContext &context);
void runReminderCheckTask(FrameContext &context);
void runReminderAlarmTask(FrameContext &context);
void runInputTask(FrameContext &context);
void runEventTask(FrameContext &context);
void runUiTask(FrameContext &context);
void runDiagnosticsTask(FrameContext &context);
void flushUiFrame();
bool flushUiFrame(bool force);
UiScreens::TimerScreenData timerScreenData(unsigned long now);
UiScreens::StopwatchScreenData stopwatchScreenData();
UiScreens::RemindersScreenData remindersScreenData();
void logTaskRuntimeProfiles();
void logTaskRuntimeRanking(uint8_t metric);
void logOverrunAttributionSummary();

ScheduledTask scheduledTasks[] = {
  { "esp8266-link", 0, 0, 0, 1200, 0, 0, true, runEsp8266LinkTask },
  { "buzzer", 5, 0, 0, 250, 0, 0, true, runBuzzerTask },
  { "hardware", 0, 0, 0, 1500, 0, 0, true, runHardwareRequestTask },
  { "lighting", 1000, 0, 0, 1500, 0, 0, true, runLightingTask },
  { "timer", 50, 0, 0, 1000, 0, 0, true, runTimerTask },
  { "reminder-check", 1000, 0, 0, 2500, 0, 0, true, runReminderCheckTask },
  { "reminder-alarm", 50, 0, 0, 1000, 0, 0, true, runReminderAlarmTask },
  { "input", 10, 0, 0, 1000, 0, 0, true, runInputTask },
  { "events", 0, 0, 0, 2500, 0, 0, true, runEventTask },
  { "ui", 50, 0, 0, 12000, 0, 0, true, runUiTask },
  { "diagnostics", 30000, 0, 0, 4000, 0, 0, true, runDiagnosticsTask }
};

Scheduler scheduler(scheduledTasks, sizeof(scheduledTasks) / sizeof(scheduledTasks[0]));

struct UiTaskTimingStats {
  uint32_t decisionUs = 0;
  uint32_t dataUs = 0;
  uint32_t menuDrawingUs = 0;
  uint32_t textRenderingUs = 0;
  uint32_t iconRenderingUs = 0;
  uint32_t animationRenderingUs = 0;
  uint32_t displayRenderingUs = 0;
  uint32_t spiTransferUs = 0;
  uint32_t frameUs = 0;
  uint32_t maxFrameUs = 0;
  uint32_t framesBuilt = 0;
  uint32_t framesFlushed = 0;
  uint32_t framesSkipped = 0;
  uint32_t unchangedFrames = 0;
  uint32_t fullScreenRedraws = 0;
  uint32_t unnecessaryRedraws = 0;
};

UiTaskTimingStats uiTiming;
char lastFlushedRows[2][17] = {
  "                ",
  "                "
};
bool lastUiFrameValid = false;

bool bootAnimation(unsigned long now){
  static uint8_t stage=0;
  static unsigned long lastStep=0;

  const char* frames[]={
    "Booting","Booting.","Booting..","Booting...","Booting....","Booting...","Booting....","Booting....."
  };

  if(stage==0){
    UiScreens::renderBootTitle(FIRMWARE_VERSION);
    AudioService::beep(50);
    HardwareRequests::executePending();
    lastStep=now;
    stage=1;
  }

  if(stage>=1 && stage<=8){
    if(now-lastStep>150){
      UiScreens::renderBootScreen(FIRMWARE_VERSION, frames[stage-1]);
      lastStep=now;
      if(stage==6) AudioService::beep(50);
      if(stage==8) AudioService::beep(50);
      HardwareRequests::executePending();
      stage++;
    }
  }

  if(stage>8){
    stage=0;
    return true;
  }
  return false;
}

void initHardware(){
  Serial.begin(115200);
  FaultTracker::begin();
  SettingsStore::begin();
  SettingsFlow::begin();
  SystemStateStore::begin(SettingsFlow::settings());
  HardwareRequests::beginLocal(SettingsFlow::settings());

  if(!TimeService::begin()){
    UiScreens::renderRtcErrorScreen();
    flushUiFrame();
    while(true){
      delay(100);
    }
  }
  if(!TimeService::isRunning()){
    TimeService::adjust(DateTime(F(__DATE__), F(__TIME__)));
  }

  Services::begin(SettingsFlow::settings());
  InputService::begin();
  HardwareRequests::requestBacklight(SystemStateStore::current().lighting.backlightEnabled, CommandSource::SYSTEM);
  HardwareRequests::executePending();

  RemindersFeature::load();
  randomSeed(esp_random());

}

bool shouldBlinkCurrentScreen(){
  if(AppNavigation::current()==STATE_TIMER_EDIT) return true;
  if(AppNavigation::current()==STATE_TIMER_VIEW && TimerFeature::isRunning()) return true;
  if(AppNavigation::current()==STATE_REMINDER_EDIT) return true;
  if(AppNavigation::current()==STATE_SETTINGS_EDIT) return SettingsFlow::shouldBlink();
  return false;
}

bool blinkDue(unsigned long now){
  return shouldBlinkCurrentScreen() && now - systemContext.ui.lastBlinkMs > 500;
}

bool screenNeedsPeriodicRefresh(AppState state){
  switch(state){
    case STATE_CLOCK:
      return true;

    case STATE_TIMER_VIEW:
      return TimerFeature::isRunning();

    case STATE_TIMER_EDIT:
    case STATE_REMINDER_EDIT:
      return shouldBlinkCurrentScreen();

    case STATE_STOPWATCH:
      return StopwatchFeature::isRunning();

    case STATE_SETTINGS_EDIT:
      return SettingsFlow::shouldBlink();

    default:
      return false;
  }
}

bool shouldBuildUiFrame(unsigned long now, bool stateChanged){
  if(stateChanged) return true;
  if(blinkDue(now)) return true;
  if(!screenNeedsPeriodicRefresh(AppNavigation::current())) return false;
  return now - systemContext.ui.lastRefreshMs > 250;
}

bool updateBlinkState(unsigned long now){
  if(!shouldBlinkCurrentScreen()) return false;
  if(now-systemContext.ui.lastBlinkMs>500){
    systemContext.ui.blinkState=!systemContext.ui.blinkState;
    systemContext.ui.lastBlinkMs=now;
    return true;
  }
  return false;
}

void startReminderAlarm(uint8_t idx, unsigned long now){
  AppNavigation::setResumeAfterReminder(AppNavigation::current());
  AppCommands::setLedMode(LED_REMINDER_ALARM);
  RemindersFeature::startAlarm(idx, now);
  AppNavigation::enter(STATE_REMINDER_ALARM);
}

